//car data
// export const cardata_lixiang=[
//     ['理想L7 Air', 319800],
//     ['理想L7 Pro', 339800],
//     ['理想L7 Max', 379800],
//     ['理想L8 Air', 339800],
//     ['理想L8 Pro', 359800],
//     ['理想L8 Max', 399800],
//     ['理想L9 Pro', 429800],
//     ['理想L9 Max', 459800],
//     ['理想MEGA Max', 559800]
// ];
// export const cardata_xiaopeng=[
//     ['G3iG3i460G+XP', 156900],
//     ['G6G6_580_Pro', 215900],
//     ['G6G6_580_Max', 229900],
//     ['2024款G9570TSa', 273900],
//     ['2024款G9570MAX', 289900],
//     ['2024款P5500PLb2', 159900],
//     ['2024款P5500PRb2', 177900],
//     ['P7i550Pro', 234900],
//     ['P7i550Max', 250900],
//     ['X9HABRPRO', 359800]
// ];
// export const cardata_weilai=[
//     ['ET5', 298000],
//     ['ET6', 398000],
//     ['ET7', 428000],
//     ['EC6', 358000],
//     ['EC7', 458000],
//     ['ES6', 338000],
//     ['ES7', 438000],
//     ['ES8', 498000]
// ];
// export const cardata_tesla=[
//     ['Model 3', 245900],  
//     ['Model Y', 258900],  
//     ['Model S', 698900],  
//     ['Model X', 738900] 
// ];
// export const cardata_huawei=[
//     ['M5', 250000],  
//     ['M7', 258900],  
//     ['M9', 469800]
// ];


export const cardata_all_new = [
    {
      brand: '理想汽车',
      linkurl: 'https://www.lixiang.com/#li',
      detaildata: [
        ['理想L7 Air', 319800],
        ['理想L7 Pro', 339800],
        ['理想L7 Max', 379800],
        ['理想L8 Air', 339800],
        ['理想L8 Pro', 359800],
        ['理想L8 Max', 399800],
        ['理想L9 Pro', 429800],
        ['理想L9 Max', 459800],
        ['理想MEGA Max', 559800]
      ]
    },
    {
      brand: '小鹏汽车',
      linkurl: 'https://www.xiaopeng.com/',
      detaildata: [
        ['G3iG3i460G+XP', 156900],
        ['G6G6_580_Pro', 215900],
        ['G6G6_580_Max', 229900],
        ['2024款G9570TSa', 273900],
        ['2024款G9570MAX', 289900],
        ['2024款P5500PLb2', 159900],
        ['2024款P5500PRb2', 177900],
        ['P7i550Pro', 234900],
        ['P7i550Max', 250900],
        ['X9HABRPRO', 359800]
      ]
    },
    {
      brand: '蔚来汽车',
      linkurl: 'https://www.nio.cn/',
      detaildata: [
        ['ET5', 298000],
        ['ET6', 398000],
        ['ET7', 428000],
        ['EC6', 358000],
        ['EC7', 458000],
        ['ES6', 338000],
        ['ES7', 438000],
        ['ES8', 498000]
      ]
    },
    {
      brand: '特斯拉',
      linkurl: '',
      detaildata: [
        ['Model 3', 245900],
        ['Model Y', 258900],
        ['Model S', 698900],
        ['Model X', 738900]
      ]
    },
    {
      brand: '华为汽车',
      linkurl: '',
      detaildata: [
        ['M5', 250000],
        ['M7', 258900],
        ['M9', 469800]
      ]
    },
    {
        brand:'哪吒汽车',
        linkurl:'',
        detaildata:[
        ['哪吒V Pro', 76900],
        ['哪吒V Pro', 80900], 
        ['哪吒GT', 188800], 
        ['哪吒GT', 226800] 
        ]
    },
    {
        brand:'比亚迪',
        linkurl:'',
        detaildata:[
            ['比亚迪汉', 189800],
            ['比亚迪唐', 209800],
            ['比亚迪宋PLUS新能源', 154800],
            ['比亚迪宋Pro新能源', 129800],
            ['比亚迪e2', 102800],
            ['比亚迪e3', 154800],
            ['比亚迪D1', 160800],
            ['比亚迪元EV', 154800], 
            ['比亚迪海豹', 189800], 
            ['比亚迪海豚', 116800], 
            ['比亚迪驱逐舰05', 101800], 
            ['比亚迪秦PLUS', 99900]
        ]
    }
];
